Autodesk.Revit.UI.TableViewUIUtils.TestCellAndPromptToEditTypeParameter(Autodesk.Revit.DB.TableView,Autodesk.Revit.DB.SectionType,System.Int32,System.Int32)
Prompts the end-user to control whether a type parameter contained in the specified table cell should be allowed edited.
Remarks:
If the specified cell contains an instance parameter, the method automatically returns true without prompting the user.
For type parameters, a task dialog will be shown and the user's choice will be returned.
tableView:
The table view.
sectionType:
The section the row lies in.
row:
The row index in the section.
column:
The column index in the section.
Returns:
Returns true if editing the cell is allowed; otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given row number row is invalid.
-or-
The given column number column is invalid.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.TableViewUIUtils
This utility class contains members that involve the Revit UI and operate on schedule views or MEP electrical panel schedules.
Since:
2016